Revit 2016 API
CompoundStructureLayerFunction Enumeration
Describes the purpose of the layer within a compound structure, such as a wall or floor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public enum CompoundStructureLayerFunction
Visual Basic
Public Enumeration CompoundStructureLayerFunction
Visual C++
public enum class CompoundStructureLayerFunction
Members
Member name | Description
Structure | A structural layer.
Substrate | A substrate layer.
ThermalOrAir | A thermal or air insulating layer.
Finish1 | A finish layer.
Finish2 | A finish layer.
MembraneLayer | A membrane layer.
StructuralDeck | A special layer considered to be structural decking.
See Also
Autodesk.Revit.DB Namespace